spt/spt_subscription_stress.log

         /\      Grafana   /â€¾â€¾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   â€¾â€¾\ 
  /          \   |   (  |  (â€¾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: spt/subscription-spt.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 4m30s max duration (incl. graceful stop):
              * stress: Up to 50 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 00/50 VUs, 0 complete and 0 interrupted iterations
stress   [   0% ] 00/50 VUs  0m01.0s/4m00.0s

running (0m02.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
stress   [   1% ] 01/50 VUs  0m02.0s/4m00.0s

running (0m03.0s), 02/50 VUs, 0 complete and 0 interrupted iterations
stress   [   1% ] 02/50 VUs  0m03.0s/4m00.0s

running (0m04.0s), 03/50 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 03/50 VUs  0m04.0s/4m00.0s

running (0m05.0s), 04/50 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 04/50 VUs  0m05.0s/4m00.0s

running (0m06.0s), 04/50 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 04/50 VUs  0m06.0s/4m00.0s

running (0m07.0s), 05/50 VUs, 0 complete and 0 interrupted iterations
stress   [   3% ] 05/50 VUs  0m07.0s/4m00.0s

running (0m08.0s), 06/50 VUs, 1 complete and 0 interrupted iterations
stress   [   3% ] 06/50 VUs  0m08.0s/4m00.0s

running (0m09.0s), 07/50 VUs, 2 complete and 0 interrupted iterations
stress   [   4% ] 07/50 VUs  0m09.0s/4m00.0s

running (0m10.0s), 08/50 VUs, 3 complete and 0 interrupted iterations
stress   [   4% ] 08/50 VUs  0m10.0s/4m00.0s

running (0m11.0s), 09/50 VUs, 4 complete and 0 interrupted iterations
stress   [   5% ] 09/50 VUs  0m11.0s/4m00.0s

running (0m12.0s), 09/50 VUs, 6 complete and 0 interrupted iterations
stress   [   5% ] 09/50 VUs  0m12.0s/4m00.0s

running (0m13.0s), 10/50 VUs, 7 complete and 0 interrupted iterations
stress   [   5% ] 10/50 VUs  0m13.0s/4m00.0s

running (0m14.0s), 11/50 VUs, 8 complete and 0 interrupted iterations
stress   [   6% ] 11/50 VUs  0m14.0s/4m00.0s

running (0m15.0s), 12/50 VUs, 10 complete and 0 interrupted iterations
stress   [   6% ] 12/50 VUs  0m15.0s/4m00.0s

running (0m16.0s), 13/50 VUs, 11 complete and 0 interrupted iterations
stress   [   7% ] 13/50 VUs  0m16.0s/4m00.0s

running (0m17.0s), 14/50 VUs, 13 complete and 0 interrupted iterations
stress   [   7% ] 14/50 VUs  0m17.0s/4m00.0s

running (0m18.0s), 14/50 VUs, 15 complete and 0 interrupted iterations
stress   [   7% ] 14/50 VUs  0m18.0s/4m00.0s

running (0m19.0s), 15/50 VUs, 18 complete and 0 interrupted iterations
stress   [   8% ] 15/50 VUs  0m19.0s/4m00.0s

running (0m20.0s), 16/50 VUs, 20 complete and 0 interrupted iterations
stress   [   8% ] 16/50 VUs  0m20.0s/4m00.0s

running (0m21.0s), 17/50 VUs, 22 complete and 0 interrupted iterations
stress   [   9% ] 17/50 VUs  0m21.0s/4m00.0s

running (0m22.0s), 18/50 VUs, 25 complete and 0 interrupted iterations
stress   [   9% ] 18/50 VUs  0m22.0s/4m00.0s

running (0m23.0s), 19/50 VUs, 27 complete and 0 interrupted iterations
stress   [  10% ] 19/50 VUs  0m23.0s/4m00.0s

running (0m24.0s), 19/50 VUs, 32 complete and 0 interrupted iterations
stress   [  10% ] 19/50 VUs  0m24.0s/4m00.0s

running (0m25.0s), 20/50 VUs, 35 complete and 0 interrupted iterations
stress   [  10% ] 20/50 VUs  0m25.0s/4m00.0s

running (0m26.0s), 21/50 VUs, 37 complete and 0 interrupted iterations
stress   [  11% ] 21/50 VUs  0m26.0s/4m00.0s

running (0m27.0s), 22/50 VUs, 41 complete and 0 interrupted iterations
stress   [  11% ] 22/50 VUs  0m27.0s/4m00.0s

running (0m28.0s), 23/50 VUs, 42 complete and 0 interrupted iterations
stress   [  12% ] 23/50 VUs  0m28.0s/4m00.0s

running (0m29.0s), 24/50 VUs, 49 complete and 0 interrupted iterations
stress   [  12% ] 24/50 VUs  0m29.0s/4m00.0s

running (0m30.0s), 24/50 VUs, 52 complete and 0 interrupted iterations
stress   [  12% ] 24/50 VUs  0m30.0s/4m00.0s

running (0m31.0s), 25/50 VUs, 56 complete and 0 interrupted iterations
stress   [  13% ] 25/50 VUs  0m31.0s/4m00.0s

running (0m32.0s), 26/50 VUs, 61 complete and 0 interrupted iterations
stress   [  13% ] 26/50 VUs  0m32.0s/4m00.0s

running (0m33.0s), 27/50 VUs, 64 complete and 0 interrupted iterations
stress   [  14% ] 27/50 VUs  0m33.0s/4m00.0s

running (0m34.0s), 28/50 VUs, 68 complete and 0 interrupted iterations
stress   [  14% ] 28/50 VUs  0m34.0s/4m00.0s

running (0m35.0s), 29/50 VUs, 73 complete and 0 interrupted iterations
stress   [  15% ] 29/50 VUs  0m35.0s/4m00.0s

running (0m36.0s), 29/50 VUs, 79 complete and 0 interrupted iterations
stress   [  15% ] 29/50 VUs  0m36.0s/4m00.0s

running (0m37.0s), 30/50 VUs, 83 complete and 0 interrupted iterations
stress   [  15% ] 30/50 VUs  0m37.0s/4m00.0s

running (0m38.0s), 31/50 VUs, 85 complete and 0 interrupted iterations
stress   [  16% ] 31/50 VUs  0m38.0s/4m00.0s

running (0m39.0s), 32/50 VUs, 85 complete and 0 interrupted iterations
stress   [  16% ] 32/50 VUs  0m39.0s/4m00.0s

running (0m40.0s), 33/50 VUs, 86 complete and 0 interrupted iterations
stress   [  17% ] 33/50 VUs  0m40.0s/4m00.0s

running (0m41.0s), 34/50 VUs, 93 complete and 0 interrupted iterations
stress   [  17% ] 34/50 VUs  0m41.0s/4m00.0s

running (0m42.0s), 34/50 VUs, 93 complete and 0 interrupted iterations
stress   [  17% ] 34/50 VUs  0m42.0s/4m00.0s

running (0m43.0s), 35/50 VUs, 104 complete and 0 interrupted iterations
stress   [  18% ] 35/50 VUs  0m43.0s/4m00.0s

running (0m44.0s), 36/50 VUs, 112 complete and 0 interrupted iterations
stress   [  18% ] 36/50 VUs  0m44.0s/4m00.0s

running (0m45.0s), 37/50 VUs, 115 complete and 0 interrupted iterations
stress   [  19% ] 37/50 VUs  0m45.0s/4m00.0s

running (0m46.0s), 38/50 VUs, 121 complete and 0 interrupted iterations
stress   [  19% ] 38/50 VUs  0m46.0s/4m00.0s

running (0m47.0s), 39/50 VUs, 126 complete and 0 interrupted iterations
stress   [  20% ] 39/50 VUs  0m47.0s/4m00.0s

running (0m48.0s), 39/50 VUs, 127 complete and 0 interrupted iterations
stress   [  20% ] 39/50 VUs  0m48.0s/4m00.0s

running (0m49.0s), 40/50 VUs, 128 complete and 0 interrupted iterations
stress   [  20% ] 40/50 VUs  0m49.0s/4m00.0s

running (0m50.0s), 41/50 VUs, 129 complete and 0 interrupted iterations
stress   [  21% ] 41/50 VUs  0m50.0s/4m00.0s

running (0m51.0s), 42/50 VUs, 141 complete and 0 interrupted iterations
stress   [  21% ] 42/50 VUs  0m51.0s/4m00.0s

running (0m52.0s), 43/50 VUs, 147 complete and 0 interrupted iterations
stress   [  22% ] 43/50 VUs  0m52.0s/4m00.0s

running (0m53.0s), 44/50 VUs, 151 complete and 0 interrupted iterations
stress   [  22% ] 44/50 VUs  0m53.0s/4m00.0s

running (0m54.0s), 44/50 VUs, 162 complete and 0 interrupted iterations
stress   [  22% ] 44/50 VUs  0m54.0s/4m00.0s

running (0m55.0s), 45/50 VUs, 163 complete and 0 interrupted iterations
stress   [  23% ] 45/50 VUs  0m55.0s/4m00.0s

running (0m56.0s), 46/50 VUs, 165 complete and 0 interrupted iterations
stress   [  23% ] 46/50 VUs  0m56.0s/4m00.0s

running (0m57.0s), 47/50 VUs, 174 complete and 0 interrupted iterations
stress   [  24% ] 47/50 VUs  0m57.0s/4m00.0s

running (0m58.0s), 48/50 VUs, 178 complete and 0 interrupted iterations
stress   [  24% ] 48/50 VUs  0m58.0s/4m00.0s

running (0m59.0s), 49/50 VUs, 180 complete and 0 interrupted iterations
stress   [  25% ] 49/50 VUs  0m59.0s/4m00.0s

running (1m00.0s), 49/50 VUs, 182 complete and 0 interrupted iterations
stress   [  25% ] 49/50 VUs  1m00.0s/4m00.0s

running (1m01.0s), 50/50 VUs, 197 complete and 0 interrupted iterations
stress   [  25% ] 50/50 VUs  1m01.0s/4m00.0s

running (1m02.0s), 50/50 VUs, 197 complete and 0 interrupted iterations
stress   [  26% ] 50/50 VUs  1m02.0s/4m00.0s

running (1m03.0s), 50/50 VUs, 197 complete and 0 interrupted iterations
stress   [  26% ] 50/50 VUs  1m03.0s/4m00.0s

running (1m04.0s), 50/50 VUs, 209 complete and 0 interrupted iterations
stress   [  27% ] 50/50 VUs  1m04.0s/4m00.0s

running (1m05.0s), 50/50 VUs, 213 complete and 0 interrupted iterations
stress   [  27% ] 50/50 VUs  1m05.0s/4m00.0s

running (1m06.0s), 50/50 VUs, 213 complete and 0 interrupted iterations
stress   [  27% ] 50/50 VUs  1m06.0s/4m00.0s

running (1m07.0s), 50/50 VUs, 230 complete and 0 interrupted iterations
stress   [  28% ] 50/50 VUs  1m07.0s/4m00.0s

running (1m08.0s), 50/50 VUs, 231 complete and 0 interrupted iterations
stress   [  28% ] 50/50 VUs  1m08.0s/4m00.0s

running (1m09.0s), 50/50 VUs, 238 complete and 0 interrupted iterations
stress   [  29% ] 50/50 VUs  1m09.0s/4m00.0s

running (1m10.0s), 50/50 VUs, 239 complete and 0 interrupted iterations
stress   [  29% ] 50/50 VUs  1m10.0s/4m00.0s

running (1m11.0s), 50/50 VUs, 245 complete and 0 interrupted iterations
stress   [  30% ] 50/50 VUs  1m11.0s/4m00.0s

running (1m12.0s), 50/50 VUs, 249 complete and 0 interrupted iterations
stress   [  30% ] 50/50 VUs  1m12.0s/4m00.0s

running (1m13.0s), 50/50 VUs, 249 complete and 0 interrupted iterations
stress   [  30% ] 50/50 VUs  1m13.0s/4m00.0s

running (1m14.0s), 50/50 VUs, 267 complete and 0 interrupted iterations
stress   [  31% ] 50/50 VUs  1m14.0s/4m00.0s

running (1m15.0s), 50/50 VUs, 282 complete and 0 interrupted iterations
stress   [  31% ] 50/50 VUs  1m15.0s/4m00.0s

running (1m16.0s), 50/50 VUs, 288 complete and 0 interrupted iterations
stress   [  32% ] 50/50 VUs  1m16.0s/4m00.0s

running (1m17.0s), 50/50 VUs, 297 complete and 0 interrupted iterations
stress   [  32% ] 50/50 VUs  1m17.0s/4m00.0s

running (1m18.0s), 50/50 VUs, 299 complete and 0 interrupted iterations
stress   [  32% ] 50/50 VUs  1m18.0s/4m00.0s

running (1m19.0s), 50/50 VUs, 309 complete and 0 interrupted iterations
stress   [  33% ] 50/50 VUs  1m19.0s/4m00.0s

running (1m20.0s), 50/50 VUs, 322 complete and 0 interrupted iterations
stress   [  33% ] 50/50 VUs  1m20.0s/4m00.0s

running (1m21.0s), 50/50 VUs, 322 complete and 0 interrupted iterations
stress   [  34% ] 50/50 VUs  1m21.0s/4m00.0s

running (1m22.0s), 50/50 VUs, 324 complete and 0 interrupted iterations
stress   [  34% ] 50/50 VUs  1m22.0s/4m00.0s

running (1m23.0s), 50/50 VUs, 324 complete and 0 interrupted iterations
stress   [  35% ] 50/50 VUs  1m23.0s/4m00.0s

running (1m24.0s), 50/50 VUs, 336 complete and 0 interrupted iterations
stress   [  35% ] 50/50 VUs  1m24.0s/4m00.0s

running (1m25.0s), 50/50 VUs, 343 complete and 0 interrupted iterations
stress   [  35% ] 50/50 VUs  1m25.0s/4m00.0s

running (1m26.0s), 50/50 VUs, 351 complete and 0 interrupted iterations
stress   [  36% ] 50/50 VUs  1m26.0s/4m00.0s

running (1m27.0s), 50/50 VUs, 355 complete and 0 interrupted iterations
stress   [  36% ] 50/50 VUs  1m27.0s/4m00.0s

running (1m28.0s), 50/50 VUs, 369 complete and 0 interrupted iterations
stress   [  37% ] 50/50 VUs  1m28.0s/4m00.0s

running (1m29.0s), 50/50 VUs, 373 complete and 0 interrupted iterations
stress   [  37% ] 50/50 VUs  1m29.0s/4m00.0s

running (1m30.0s), 50/50 VUs, 373 complete and 0 interrupted iterations
stress   [  37% ] 50/50 VUs  1m30.0s/4m00.0s

running (1m31.0s), 50/50 VUs, 375 complete and 0 interrupted iterations
stress   [  38% ] 50/50 VUs  1m31.0s/4m00.0s

running (1m32.0s), 50/50 VUs, 377 complete and 0 interrupted iterations
stress   [  38% ] 50/50 VUs  1m32.0s/4m00.0s

running (1m33.0s), 50/50 VUs, 392 complete and 0 interrupted iterations
stress   [  39% ] 50/50 VUs  1m33.0s/4m00.0s

running (1m34.0s), 50/50 VUs, 411 complete and 0 interrupted iterations
stress   [  39% ] 50/50 VUs  1m34.0s/4m00.0s

running (1m35.0s), 50/50 VUs, 423 complete and 0 interrupted iterations
stress   [  40% ] 50/50 VUs  1m35.0s/4m00.0s

running (1m36.0s), 50/50 VUs, 423 complete and 0 interrupted iterations
stress   [  40% ] 50/50 VUs  1m36.0s/4m00.0s

running (1m37.0s), 50/50 VUs, 423 complete and 0 interrupted iterations
stress   [  40% ] 50/50 VUs  1m37.0s/4m00.0s

running (1m38.0s), 50/50 VUs, 423 complete and 0 interrupted iterations
stress   [  41% ] 50/50 VUs  1m38.0s/4m00.0s

running (1m39.0s), 50/50 VUs, 423 complete and 0 interrupted iterations
stress   [  41% ] 50/50 VUs  1m39.0s/4m00.0s

running (1m40.0s), 50/50 VUs, 427 complete and 0 interrupted iterations
stress   [  42% ] 50/50 VUs  1m40.0s/4m00.0s

running (1m41.0s), 50/50 VUs, 440 complete and 0 interrupted iterations
stress   [  42% ] 50/50 VUs  1m41.0s/4m00.0s

running (1m42.0s), 50/50 VUs, 449 complete and 0 interrupted iterations
stress   [  42% ] 50/50 VUs  1m42.0s/4m00.0s

running (1m43.0s), 50/50 VUs, 453 complete and 0 interrupted iterations
stress   [  43% ] 50/50 VUs  1m43.0s/4m00.0s

running (1m44.0s), 50/50 VUs, 464 complete and 0 interrupted iterations
stress   [  43% ] 50/50 VUs  1m44.0s/4m00.0s

running (1m45.0s), 50/50 VUs, 473 complete and 0 interrupted iterations
stress   [  44% ] 50/50 VUs  1m45.0s/4m00.0s

running (1m46.0s), 50/50 VUs, 473 complete and 0 interrupted iterations
stress   [  44% ] 50/50 VUs  1m46.0s/4m00.0s

running (1m47.0s), 50/50 VUs, 473 complete and 0 interrupted iterations
stress   [  45% ] 50/50 VUs  1m47.0s/4m00.0s

running (1m48.0s), 50/50 VUs, 474 complete and 0 interrupted iterations
stress   [  45% ] 50/50 VUs  1m48.0s/4m00.0s

running (1m49.0s), 50/50 VUs, 479 complete and 0 interrupted iterations
stress   [  45% ] 50/50 VUs  1m49.0s/4m00.0s

running (1m50.0s), 50/50 VUs, 486 complete and 0 interrupted iterations
stress   [  46% ] 50/50 VUs  1m50.0s/4m00.0s

running (1m51.0s), 50/50 VUs, 504 complete and 0 interrupted iterations
stress   [  46% ] 50/50 VUs  1m51.0s/4m00.0s

running (1m52.0s), 50/50 VUs, 517 complete and 0 interrupted iterations
stress   [  47% ] 50/50 VUs  1m52.0s/4m00.0s

running (1m53.0s), 50/50 VUs, 522 complete and 0 interrupted iterations
stress   [  47% ] 50/50 VUs  1m53.0s/4m00.0s

running (1m54.0s), 50/50 VUs, 523 complete and 0 interrupted iterations
stress   [  47% ] 50/50 VUs  1m54.0s/4m00.0s

running (1m55.0s), 50/50 VUs, 524 complete and 0 interrupted iterations
stress   [  48% ] 50/50 VUs  1m55.0s/4m00.0s

running (1m56.0s), 50/50 VUs, 525 complete and 0 interrupted iterations
stress   [  48% ] 50/50 VUs  1m56.0s/4m00.0s

running (1m57.0s), 50/50 VUs, 533 complete and 0 interrupted iterations
stress   [  49% ] 50/50 VUs  1m57.0s/4m00.0s

running (1m58.0s), 50/50 VUs, 548 complete and 0 interrupted iterations
stress   [  49% ] 50/50 VUs  1m58.0s/4m00.0s

running (1m59.0s), 50/50 VUs, 552 complete and 0 interrupted iterations
stress   [  50% ] 50/50 VUs  1m59.0s/4m00.0s

running (2m00.0s), 50/50 VUs, 553 complete and 0 interrupted iterations
stress   [  50% ] 50/50 VUs  2m00.0s/4m00.0s

running (2m01.0s), 50/50 VUs, 564 complete and 0 interrupted iterations
stress   [  50% ] 50/50 VUs  2m01.0s/4m00.0s

running (2m02.0s), 50/50 VUs, 573 complete and 0 interrupted iterations
stress   [  51% ] 50/50 VUs  2m02.0s/4m00.0s

running (2m03.0s), 50/50 VUs, 573 complete and 0 interrupted iterations
stress   [  51% ] 50/50 VUs  2m03.0s/4m00.0s

running (2m04.0s), 50/50 VUs, 573 complete and 0 interrupted iterations
stress   [  52% ] 50/50 VUs  2m04.0s/4m00.0s

running (2m05.0s), 50/50 VUs, 588 complete and 0 interrupted iterations
stress   [  52% ] 50/50 VUs  2m05.0s/4m00.0s

running (2m06.0s), 50/50 VUs, 589 complete and 0 interrupted iterations
stress   [  52% ] 50/50 VUs  2m06.0s/4m00.0s

running (2m07.0s), 50/50 VUs, 590 complete and 0 interrupted iterations
stress   [  53% ] 50/50 VUs  2m07.0s/4m00.0s

running (2m08.0s), 50/50 VUs, 593 complete and 0 interrupted iterations
stress   [  53% ] 50/50 VUs  2m08.0s/4m00.0s

running (2m09.0s), 50/50 VUs, 608 complete and 0 interrupted iterations
stress   [  54% ] 50/50 VUs  2m09.0s/4m00.0s

running (2m10.0s), 50/50 VUs, 615 complete and 0 interrupted iterations
stress   [  54% ] 50/50 VUs  2m10.0s/4m00.0s

running (2m11.0s), 50/50 VUs, 620 complete and 0 interrupted iterations
stress   [  55% ] 50/50 VUs  2m11.0s/4m00.0s

running (2m12.0s), 50/50 VUs, 634 complete and 0 interrupted iterations
stress   [  55% ] 50/50 VUs  2m12.0s/4m00.0s

running (2m13.0s), 50/50 VUs, 640 complete and 0 interrupted iterations
stress   [  55% ] 50/50 VUs  2m13.0s/4m00.0s

running (2m14.0s), 50/50 VUs, 645 complete and 0 interrupted iterations
stress   [  56% ] 50/50 VUs  2m14.0s/4m00.0s

running (2m15.0s), 50/50 VUs, 660 complete and 0 interrupted iterations
stress   [  56% ] 50/50 VUs  2m15.0s/4m00.0s

running (2m16.0s), 50/50 VUs, 662 complete and 0 interrupted iterations
stress   [  57% ] 50/50 VUs  2m16.0s/4m00.0s

running (2m17.0s), 50/50 VUs, 665 complete and 0 interrupted iterations
stress   [  57% ] 50/50 VUs  2m17.0s/4m00.0s

running (2m18.0s), 50/50 VUs, 665 complete and 0 interrupted iterations
stress   [  57% ] 50/50 VUs  2m18.0s/4m00.0s

running (2m19.0s), 50/50 VUs, 670 complete and 0 interrupted iterations
stress   [  58% ] 50/50 VUs  2m19.0s/4m00.0s

running (2m20.0s), 50/50 VUs, 678 complete and 0 interrupted iterations
stress   [  58% ] 50/50 VUs  2m20.0s/4m00.0s

running (2m21.0s), 50/50 VUs, 678 complete and 0 interrupted iterations
stress   [  59% ] 50/50 VUs  2m21.0s/4m00.0s

running (2m22.0s), 50/50 VUs, 686 complete and 0 interrupted iterations
stress   [  59% ] 50/50 VUs  2m22.0s/4m00.0s

running (2m23.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
stress   [  60% ] 50/50 VUs  2m23.0s/4m00.0s

running (2m24.0s), 50/50 VUs, 714 complete and 0 interrupted iterations
stress   [  60% ] 50/50 VUs  2m24.0s/4m00.0s

running (2m25.0s), 50/50 VUs, 715 complete and 0 interrupted iterations
stress   [  60% ] 50/50 VUs  2m25.0s/4m00.0s

running (2m26.0s), 50/50 VUs, 722 complete and 0 interrupted iterations
stress   [  61% ] 50/50 VUs  2m26.0s/4m00.0s

running (2m27.0s), 50/50 VUs, 728 complete and 0 interrupted iterations
stress   [  61% ] 50/50 VUs  2m27.0s/4m00.0s

running (2m28.0s), 50/50 VUs, 728 complete and 0 interrupted iterations
stress   [  62% ] 50/50 VUs  2m28.0s/4m00.0s

running (2m29.0s), 50/50 VUs, 728 complete and 0 interrupted iterations
stress   [  62% ] 50/50 VUs  2m29.0s/4m00.0s

running (2m30.0s), 50/50 VUs, 738 complete and 0 interrupted iterations
stress   [  62% ] 50/50 VUs  2m30.0s/4m00.0s

running (2m31.0s), 50/50 VUs, 747 complete and 0 interrupted iterations
stress   [  63% ] 50/50 VUs  2m31.0s/4m00.0s

running (2m32.0s), 50/50 VUs, 748 complete and 0 interrupted iterations
stress   [  63% ] 50/50 VUs  2m32.0s/4m00.0s

running (2m33.0s), 50/50 VUs, 773 complete and 0 interrupted iterations
stress   [  64% ] 50/50 VUs  2m33.0s/4m00.0s

running (2m34.0s), 50/50 VUs, 774 complete and 0 interrupted iterations
stress   [  64% ] 50/50 VUs  2m34.0s/4m00.0s

running (2m35.0s), 50/50 VUs, 778 complete and 0 interrupted iterations
stress   [  65% ] 50/50 VUs  2m35.0s/4m00.0s

running (2m36.0s), 50/50 VUs, 790 complete and 0 interrupted iterations
stress   [  65% ] 50/50 VUs  2m36.0s/4m00.0s

running (2m37.0s), 50/50 VUs, 793 complete and 0 interrupted iterations
stress   [  65% ] 50/50 VUs  2m37.0s/4m00.0s

running (2m38.0s), 50/50 VUs, 793 complete and 0 interrupted iterations
stress   [  66% ] 50/50 VUs  2m38.0s/4m00.0s

running (2m39.0s), 50/50 VUs, 798 complete and 0 interrupted iterations
stress   [  66% ] 50/50 VUs  2m39.0s/4m00.0s

running (2m40.0s), 50/50 VUs, 806 complete and 0 interrupted iterations
stress   [  67% ] 50/50 VUs  2m40.0s/4m00.0s

running (2m41.0s), 50/50 VUs, 822 complete and 0 interrupted iterations
stress   [  67% ] 50/50 VUs  2m41.0s/4m00.0s

running (2m42.0s), 50/50 VUs, 840 complete and 0 interrupted iterations
stress   [  67% ] 50/50 VUs  2m42.0s/4m00.0s

running (2m43.0s), 50/50 VUs, 842 complete and 0 interrupted iterations
stress   [  68% ] 50/50 VUs  2m43.0s/4m00.0s

running (2m44.0s), 50/50 VUs, 845 complete and 0 interrupted iterations
stress   [  68% ] 50/50 VUs  2m44.0s/4m00.0s

running (2m45.0s), 50/50 VUs, 849 complete and 0 interrupted iterations
stress   [  69% ] 50/50 VUs  2m45.0s/4m00.0s

running (2m46.0s), 50/50 VUs, 855 complete and 0 interrupted iterations
stress   [  69% ] 50/50 VUs  2m46.0s/4m00.0s

running (2m47.0s), 50/50 VUs, 856 complete and 0 interrupted iterations
stress   [  70% ] 50/50 VUs  2m47.0s/4m00.0s

running (2m48.0s), 50/50 VUs, 861 complete and 0 interrupted iterations
stress   [  70% ] 50/50 VUs  2m48.0s/4m00.0s

running (2m49.0s), 50/50 VUs, 876 complete and 0 interrupted iterations
stress   [  70% ] 50/50 VUs  2m49.0s/4m00.0s

running (2m50.0s), 50/50 VUs, 879 complete and 0 interrupted iterations
stress   [  71% ] 50/50 VUs  2m50.0s/4m00.0s

running (2m51.0s), 50/50 VUs, 879 complete and 0 interrupted iterations
stress   [  71% ] 50/50 VUs  2m51.0s/4m00.0s

running (2m52.0s), 50/50 VUs, 887 complete and 0 interrupted iterations
stress   [  72% ] 50/50 VUs  2m52.0s/4m00.0s

running (2m53.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
stress   [  72% ] 50/50 VUs  2m53.0s/4m00.0s

running (2m54.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
stress   [  72% ] 50/50 VUs  2m54.0s/4m00.0s

running (2m55.0s), 50/50 VUs, 911 complete and 0 interrupted iterations
stress   [  73% ] 50/50 VUs  2m55.0s/4m00.0s

running (2m56.0s), 50/50 VUs, 914 complete and 0 interrupted iterations
stress   [  73% ] 50/50 VUs  2m56.0s/4m00.0s

running (2m57.0s), 50/50 VUs, 919 complete and 0 interrupted iterations
stress   [  74% ] 50/50 VUs  2m57.0s/4m00.0s

running (2m58.0s), 50/50 VUs, 923 complete and 0 interrupted iterations
stress   [  74% ] 50/50 VUs  2m58.0s/4m00.0s

running (2m59.0s), 50/50 VUs, 938 complete and 0 interrupted iterations
stress   [  75% ] 50/50 VUs  2m59.0s/4m00.0s

running (3m00.0s), 50/50 VUs, 943 complete and 0 interrupted iterations
stress   [  75% ] 50/50 VUs  3m00.0s/4m00.0s

running (3m01.0s), 50/50 VUs, 948 complete and 0 interrupted iterations
stress   [  75% ] 50/50 VUs  3m01.0s/4m00.0s

running (3m02.0s), 50/50 VUs, 956 complete and 0 interrupted iterations
stress   [  76% ] 50/50 VUs  3m02.0s/4m00.0s

running (3m03.0s), 50/50 VUs, 959 complete and 0 interrupted iterations
stress   [  76% ] 50/50 VUs  3m03.0s/4m00.0s

running (3m04.0s), 50/50 VUs, 959 complete and 0 interrupted iterations
stress   [  77% ] 50/50 VUs  3m04.0s/4m00.0s

running (3m05.0s), 50/50 VUs, 960 complete and 0 interrupted iterations
stress   [  77% ] 50/50 VUs  3m05.0s/4m00.0s

running (3m06.0s), 48/50 VUs, 973 complete and 0 interrupted iterations
stress   [  77% ] 48/50 VUs  3m06.0s/4m00.0s

running (3m07.0s), 47/50 VUs, 977 complete and 0 interrupted iterations
stress   [  78% ] 47/50 VUs  3m07.0s/4m00.0s

running (3m08.0s), 45/50 VUs, 993 complete and 0 interrupted iterations
stress   [  78% ] 45/50 VUs  3m08.0s/4m00.0s

running (3m09.0s), 45/50 VUs, 1000 complete and 0 interrupted iterations
stress   [  79% ] 45/50 VUs  3m09.0s/4m00.0s

running (3m10.0s), 44/50 VUs, 1009 complete and 0 interrupted iterations
stress   [  79% ] 44/50 VUs  3m10.0s/4m00.0s

running (3m11.0s), 44/50 VUs, 1009 complete and 0 interrupted iterations
stress   [  80% ] 44/50 VUs  3m11.0s/4m00.0s

running (3m12.0s), 44/50 VUs, 1012 complete and 0 interrupted iterations
stress   [  80% ] 44/50 VUs  3m12.0s/4m00.0s

running (3m13.0s), 44/50 VUs, 1012 complete and 0 interrupted iterations
stress   [  80% ] 44/50 VUs  3m13.0s/4m00.0s

running (3m14.0s), 43/50 VUs, 1027 complete and 0 interrupted iterations
stress   [  81% ] 43/50 VUs  3m14.0s/4m00.0s

running (3m15.0s), 43/50 VUs, 1027 complete and 0 interrupted iterations
stress   [  81% ] 43/50 VUs  3m15.0s/4m00.0s

running (3m16.0s), 42/50 VUs, 1030 complete and 0 interrupted iterations
stress   [  82% ] 42/50 VUs  3m16.0s/4m00.0s

running (3m17.0s), 40/50 VUs, 1035 complete and 0 interrupted iterations
stress   [  82% ] 40/50 VUs  3m17.0s/4m00.0s

running (3m18.0s), 39/50 VUs, 1051 complete and 0 interrupted iterations
stress   [  82% ] 39/50 VUs  3m18.0s/4m00.0s

running (3m19.0s), 39/50 VUs, 1052 complete and 0 interrupted iterations
stress   [  83% ] 39/50 VUs  3m19.0s/4m00.0s

running (3m20.0s), 39/50 VUs, 1053 complete and 0 interrupted iterations
stress   [  83% ] 39/50 VUs  3m20.0s/4m00.0s

running (3m21.0s), 39/50 VUs, 1054 complete and 0 interrupted iterations
stress   [  84% ] 39/50 VUs  3m21.0s/4m00.0s

running (3m22.0s), 37/50 VUs, 1064 complete and 0 interrupted iterations
stress   [  84% ] 37/50 VUs  3m22.0s/4m00.0s

running (3m23.0s), 35/50 VUs, 1070 complete and 0 interrupted iterations
stress   [  85% ] 35/50 VUs  3m23.0s/4m00.0s

running (3m24.0s), 33/50 VUs, 1089 complete and 0 interrupted iterations
stress   [  85% ] 33/50 VUs  3m24.0s/4m00.0s

running (3m25.0s), 32/50 VUs, 1091 complete and 0 interrupted iterations
stress   [  85% ] 32/50 VUs  3m25.0s/4m00.0s

running (3m26.0s), 31/50 VUs, 1093 complete and 0 interrupted iterations
stress   [  86% ] 31/50 VUs  3m26.0s/4m00.0s

running (3m27.0s), 30/50 VUs, 1101 complete and 0 interrupted iterations
stress   [  86% ] 30/50 VUs  3m27.0s/4m00.0s

running (3m28.0s), 30/50 VUs, 1102 complete and 0 interrupted iterations
stress   [  87% ] 30/50 VUs  3m28.0s/4m00.0s

running (3m29.0s), 30/50 VUs, 1106 complete and 0 interrupted iterations
stress   [  87% ] 30/50 VUs  3m29.0s/4m00.0s

running (3m30.0s), 29/50 VUs, 1110 complete and 0 interrupted iterations
stress   [  87% ] 29/50 VUs  3m30.0s/4m00.0s

running (3m31.0s), 26/50 VUs, 1123 complete and 0 interrupted iterations
stress   [  88% ] 26/50 VUs  3m31.0s/4m00.0s

running (3m32.0s), 26/50 VUs, 1123 complete and 0 interrupted iterations
stress   [  88% ] 26/50 VUs  3m32.0s/4m00.0s

running (3m33.0s), 25/50 VUs, 1125 complete and 0 interrupted iterations
stress   [  89% ] 25/50 VUs  3m33.0s/4m00.0s

running (3m34.0s), 24/50 VUs, 1131 complete and 0 interrupted iterations
stress   [  89% ] 24/50 VUs  3m34.0s/4m00.0s

running (3m35.0s), 24/50 VUs, 1133 complete and 0 interrupted iterations
stress   [  90% ] 24/50 VUs  3m35.0s/4m00.0s

running (3m36.0s), 23/50 VUs, 1139 complete and 0 interrupted iterations
stress   [  90% ] 23/50 VUs  3m36.0s/4m00.0s

running (3m37.0s), 23/50 VUs, 1145 complete and 0 interrupted iterations
stress   [  90% ] 23/50 VUs  3m37.0s/4m00.0s

running (3m38.0s), 23/50 VUs, 1149 complete and 0 interrupted iterations
stress   [  91% ] 23/50 VUs  3m38.0s/4m00.0s

running (3m39.0s), 21/50 VUs, 1155 complete and 0 interrupted iterations
stress   [  91% ] 21/50 VUs  3m39.0s/4m00.0s

running (3m40.0s), 20/50 VUs, 1156 complete and 0 interrupted iterations
stress   [  92% ] 20/50 VUs  3m40.0s/4m00.0s

running (3m41.0s), 18/50 VUs, 1160 complete and 0 interrupted iterations
stress   [  92% ] 18/50 VUs  3m41.0s/4m00.0s

running (3m42.0s), 17/50 VUs, 1169 complete and 0 interrupted iterations
stress   [  92% ] 17/50 VUs  3m42.0s/4m00.0s

running (3m43.0s), 17/50 VUs, 1172 complete and 0 interrupted iterations
stress   [  93% ] 17/50 VUs  3m43.0s/4m00.0s

running (3m44.0s), 16/50 VUs, 1176 complete and 0 interrupted iterations
stress   [  93% ] 16/50 VUs  3m44.0s/4m00.0s

running (3m45.0s), 16/50 VUs, 1176 complete and 0 interrupted iterations
stress   [  94% ] 16/50 VUs  3m45.0s/4m00.0s

running (3m46.0s), 16/50 VUs, 1178 complete and 0 interrupted iterations
stress   [  94% ] 16/50 VUs  3m46.0s/4m00.0s

running (3m47.0s), 14/50 VUs, 1186 complete and 0 interrupted iterations
stress   [  95% ] 14/50 VUs  3m47.0s/4m00.0s

running (3m48.0s), 14/50 VUs, 1188 complete and 0 interrupted iterations
stress   [  95% ] 14/50 VUs  3m48.0s/4m00.0s

running (3m49.0s), 13/50 VUs, 1189 complete and 0 interrupted iterations
stress   [  95% ] 13/50 VUs  3m49.0s/4m00.0s

running (3m50.0s), 11/50 VUs, 1191 complete and 0 interrupted iterations
stress   [  96% ] 11/50 VUs  3m50.0s/4m00.0s

running (3m51.0s), 10/50 VUs, 1193 complete and 0 interrupted iterations
stress   [  96% ] 10/50 VUs  3m51.0s/4m00.0s

running (3m52.0s), 07/50 VUs, 1200 complete and 0 interrupted iterations
stress   [  97% ] 07/50 VUs  3m52.0s/4m00.0s

running (3m53.0s), 07/50 VUs, 1201 complete and 0 interrupted iterations
stress   [  97% ] 07/50 VUs  3m53.0s/4m00.0s

running (3m54.0s), 07/50 VUs, 1202 complete and 0 interrupted iterations
stress   [  97% ] 07/50 VUs  3m54.0s/4m00.0s

running (3m55.0s), 07/50 VUs, 1202 complete and 0 interrupted iterations
stress   [  98% ] 07/50 VUs  3m55.0s/4m00.0s

running (3m56.0s), 06/50 VUs, 1204 complete and 0 interrupted iterations
stress   [  98% ] 06/50 VUs  3m56.0s/4m00.0s

running (3m57.0s), 05/50 VUs, 1207 complete and 0 interrupted iterations
stress   [  99% ] 05/50 VUs  3m57.0s/4m00.0s

running (3m58.0s), 04/50 VUs, 1208 complete and 0 interrupted iterations
stress   [  99% ] 04/50 VUs  3m58.0s/4m00.0s

running (3m59.0s), 03/50 VUs, 1209 complete and 0 interrupted iterations
stress   [ 100% ] 03/50 VUs  3m59.0s/4m00.0s

running (4m00.0s), 03/50 VUs, 1209 complete and 0 interrupted iterations
stress   [ 100% ] 03/50 VUs  4m00.0s/4m00.0s

running (4m01.0s), 02/50 VUs, 1210 complete and 0 interrupted iterations
stress â†“ [ 100% ] 03/50 VUs  4m0s


  â–ˆ THRESHOLDS 

    http_req_failed
    âœ“ 'rate<0.01' rate=0.00%


  â–ˆ TOTAL RESULTS 

    checks_total.......: 3636    15.039792/s
    checks_succeeded...: 100.00% 3636 out of 3636
    checks_failed......: 0.00%   0 out of 3636

    âœ“ subscription plans list is 200
    âœ“ my subscription details is 200
    âœ“ usage history is 200

    HTTP
    http_req_duration..............: avg=1.16s min=271.23ms med=789.99ms max=10.29s p(90)=2.56s p(95)=2.99s
      { expected_response:true }...: avg=1.16s min=271.23ms med=789.99ms max=10.29s p(90)=2.56s p(95)=2.99s
    http_req_failed................: 0.00%  0 out of 3686
    http_reqs......................: 3686   15.24661/s

    EXECUTION
    iteration_duration.............: avg=7.56s min=4.84s    med=7.52s    max=18.71s p(90)=9.72s p(95)=10.3s
    iterations.....................: 1212   5.013264/s
    vus............................: 2      min=0         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 7.1 MB 29 kB/s
    data_sent......................: 328 kB 1.4 kB/s



running (4m01.8s), 00/50 VUs, 1212 complete and 0 interrupted iterations
stress âœ“ [ 100% ] 00/50 VUs  4m0s